#include <iostream>

/*Задача 2. Створити функції, що приймає масив цілих чисел та його
розмір. Кожна з функцій виводить на екран массив з нового рядка з 
переносом рядка в кінці. 
Перша функція виводить елементи через ' ': 
1 2 3 4 5 6 7
Друга функція виводить елементи через кому:
1,2,3,4,5,6,7
Третя функція виводить елементи через кому та пробіл в дужках:
{ 1, 2, 3, 4, 5, 6, 7 }

Створити масив цих функцій через показчик на функцію та використати при
виводі за вибором користувача.
*/

int main()
{
    std::cout << "Hello World!\n";
}
