#include <iostream>
#include <Windows.h>
using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
    /*
   Задача 1. Напишіть програму, яка пропонує користувачеві ввести натуральне число n,
   а потім друкує перші n простих чисел, використовуючи лише цикл while.
   */
   /*
   Задача 2. Напишіть програму, яка пропонує користувачеві ввести натуральне число n,
   а потім друкує послідовність Фібоначчі до n-го члена, використовуючи лише цикл for.
   */
   /*
   Задача 3. Напишіть програму, яка пропонує користувачеві ввести натуральне число n,
   а потім друкує трикутник із числами з n рядків, щоб n-й рядок складався з чисел
   від n до 1. Наприклад, якщо n дорівнює 5, вихід має виглядати так:

   5
   4 5
   3 4 5
   2 3 4 5
   1 2 3 4 5
   */   
   /*
   Задача 4. Напишіть програму, яка запропонує користувачеві ввести натуральне число n,
   а потім роздрукує форму ромба, використовуючи зірочки з n рядками. Наприклад,
   якщо n дорівнює 5, результат має виглядати так:

     *
    * *
   *   *
    * *
     *
     
     */
    

     /*
   Напишіть програму, яка пропонує користувачеві ввести натуральне число n, а потім
   друкує форму піраміди, використовуючи зірочки з n рядками. Наприклад, якщо n дорівнює 5,
   результат має виглядати так:

       *
      ***
     *****
    *******
   *********

   */
    int n;
    cout << "Введіть кількість простих чисел: ";
    cin >> n;
    int space = n -1;
    int stars = 1;

    for (int i = 0; i < n; i++)
    {

        for (int j = 0; j < space; j++) { cout << ' '; }
        for (int j = 0; j < stars; j++) { cout << '*'; }
            space--;
            stars += 2;
        cout << '\n';
    }
}
