#include <iostream>
#include <Windows.h>
using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);

	// Статичний масив - це сукупність ОДНОТИПНИХ даних ФІКСОВАНОЇ довжини

 // тип даних	ім'я	розмір
 // int			arr		[2];
	int arr[2];

 // запис елемента массива прямим способом:
 // ім'я массива  індекс елемента	= значення
 // arr			  [0]				= 1;
	arr[0] = 1;

 // запис елементів массива за допомогою перерахування:
 // тип даних   ім'я масива	 розмір = перерахування що створює 5 значень int і записує у відповідні елементи
 // int			arr			 [5]	= {1,2,3,4,5}; 
	int arr2[5] = {1,2,3,4,5};

 // створення масиву з використанням пустого/неповного перерахування
	int arr3[5] = {};		// {0,0,0,0,0}
	int arr4[5] = { 1,2 };	// {1,2,0,0,0}
 // програма заповнить або повністю нулями необхідний простір, або запише існуючу інформацію і заповне залишок нулями



}
