#include <iostream>
using namespace std;
// Файли
// файловий потік - це масив даних невизначеного розміру, що може бути прочитан та оброблен програмою
// будь-який файл це набір бітів з зашифрованою в них інформацією. розміри файлів завжди в байтах
// файл завжди ОДНОвимірний масив.

const char* path = "Z:/PKO/C++/p21/ConsoleApplication33/ConsoleApplication33/MyFile.txt";

FILE* in; // змінна що зберігатиме структуру в якіій перераховані властивості файлу

int main()
{
	if (fopen_s(&in, path, "r") == NULL) // r -> read читати файл, w -> write записувати в файл
	{
		while (!feof(in)) // поки файл не закінчився. 
						  // feof(in) -> ЧИ КІНЕЦЬ ФАЙЛА? 
						  // !feof(in) -> ЧИ НЕ КІНЕЦЬ ФАЙЛУ
		{
			char* s = new char;
			fscanf_s(in, "%c", s, sizeof(char)); // просканувати файл за заданим шаблоном. %c -> один байт/символ
			// fscanf_s -> функція що бере файловий потік in, шаблон "%c", показчик на зміну s, та розмір 
			// типу даних що читається, та записує зі здвигом внутрішнього показчика інформацію в зміну s
			cout << *s;
		}
	}
	fclose(in); // закрити файл для подальшої доступності його в інших частинах програми, чи системі
}
