#include <iostream>
using namespace std;

int main()
{
    /*
    Задача 1. Створити масив MxN елементів. Заповнити його випадковими числами.
    Знайти суму всіх стовпчиків і вивести їх на екран.
    
    Задача 2. Створити масив MxN елементів. Заповнити його випадковими числами.
    Знайти суму всіх рядочків і вивести їх на екран.

    Задача 3. Створити масив MxN елементів. Заповнити його випадковими літерами.
    Замінити всі голосні на пробіли і вивести масив на екран.

    Задача 4. Створити масив MxN елементів. Заповнити його випадковими числами.
    Відсортувати кожен рядочок за зростанням.
    */
}
