#include <iostream>
using namespace std;
// укр мова
// Урок 40. Робота над двовимірними динамічними масивами.

// Задача 1. Створити двовимірний динамічний масив символів. Та заповнити його по правилу:
// всі елементи що мають парний рядок і непарний стовпчик = '@'
// всі елементи що мають непарний рядок і непарний стовпчик = '.'
// всі елементи що мають паний рядок і парний стовпчик = '.'
// всі елементи що мають непарний рядок і парний стовпчик = '@'
// вивести масив на екран зо допомогою функції

void printMultyDimentionalArray(char** arr, int m, int n) {
	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << arr[i][j] << arr[i][j];
		}
		cout << '\n';
	}
}

int main()
{
	int m;
	cin >> m;
	int n;
	cin >> n;
	char** arr = new char* [m];
	for (int i = 0; i < m; i++)
	{
		arr[i] = new char[n];
		for (int j = 0; j < n; j++)
		{
			if (i % 2 == 0 && j % 2 != 0) { arr[i][j] = char(219); }
			if (i % 2 != 0 && j % 2 != 0) { arr[i][j] = char(176); }
			if (i % 2 == 0 && j % 2 == 0) { arr[i][j] = char(176); }
			if (i % 2 != 0 && j % 2 == 0) { arr[i][j] = char(219); }
		}
	}
	printMultyDimentionalArray(arr, m, n);
}

// Задача 2. Створити двовимірний динамічний масив нецілих чисел.
// Заповнити його за правилом:
// кожний елмент дорівнює "номер рядка. номер стовпчика"
// наприклад елемент в 4 рядку і 7 стовпчику буде нецілим числом 4.7
// вивести на екран за допомогою функції