#include <Windows.h> 
#include <iostream> 
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	// Двовимірні масиви
	// Задача 1. Вивести таблицю множення від 2 до 9 та зберегти
	// данні у масиві
	// Формат:
	//   2 3 4 5 6 7 8 9
	// 2 4 6 8 10........
	// 3 6 9 ............
	// 4 8 ..16..........
	// 5 10..............
	// 6 ................
	// 7 ................
	// 8 ................
	// 9 ................
	//

	const int n = 64;
	int arr[n] = {};
	for (int j = 0; j < 8; j++)
	{
		for (int i = 0; i < 8; i++)
		{
			arr[n] = (i + 2) * (j + 2);
		}
	}

}



