#include <iostream>
using namespace std;

// Показчики. Використання показчиків у функціях та задачах

// Задача 1. Створити зміну та показчик на цю зміну. Використати 
// показчик для того, щоб змінити зміну поділивши її на 2

int main()
{
	float a;
	cin >> a;
	float* pa = &a; // створення показчика. присвоєння адреси зміної "а"
					// через оператор взяття адреси "&" 
	*pa /= 2;		// використання показчика для доступа до зміної "а"
					// через оператор розіменування "*"

	cout << a;
}