#include <iostream>
using namespace std;

int main()
{
	/* Задача 1. Створити динамічний масив nXm елементів, який буде складатися з
	чисел по порядку від 0. Прирівняти кожний елемент парних рядків до 0. */

    int n, m;
    cin >> n >> m; // n-> к-сть рядків, m-> к-сть стовпчиків
    int** arr = new int* [n]; // визначення масиву показчиків(створення рядків)
    for (int i = 0; i < n; i++)
    {
        arr[i] = new int[m]; // виділення пам'яті під рядки(створення "стовпчиків")
        for (int j = 0; j < m; j++)
        {
            arr[i][j] = i * m + j; // запис значення в кожний елемент масива
            cout << arr[i][j] << ' '; // вивід кожного елемента в рядках масива 
        }
        cout << endl; // завершення кожного рядка перенесенням на новий рядок
    }
    for (int i = 0; i < n; i++)
    {
        if (i%2 ==0) // перевірки чи рядок парний/непарний
        {
            for (int j = 0; j < m; j++) // для кожного рядка який задовільняє умову
            {
                arr[i][j] = 0;
            }
        }
    }
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            cout << arr[i][j] << ' ';
        }
        cout << endl;
    }
}
