#include <iostream>
#include <Windows.h>
using namespace std;

int main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    /* Завдання 1. Вивести на екран усі числа від нуля
    до введеного користувачем числа.

    int a;
    cout << "Введіть число до якого треба вивести значення: ";
    cin >> a;
    int i = 0;
    while (i <= a)
    {
        cout << i << ' ';
        i++;
    }
    */
    
    /*

    Завдання 2. Користувач вводить дві межі діапазону,
    вивести на екран усі числа з цього діапазону. Передбачити,
    щоб користувач міг вводити межі діапазону в довільному
    порядку.
    
    int a, b;
    cout << "Введіть перше число діапазону: ";
    cin >> a;
    cout << "Введіть друге число діапазону: ";
    cin >> b;
    
    if (a > b)
    {
        while (a >= b)
        {
            cout << a-- << ' ';
        }
    }
    else {
        while (a <= b)
        {
            cout << a++ << ' ';
        }
    }
    */
    
    /*
    Завдання 3. Користувач вводить дві межі діапазону.
    Порахувати суму всіх чисел діапазону.
    
    
    int a, b;
    cout << "Введіть перше число діапазону: ";
    cin >> a;
    cout << "Введіть друге число діапазону: ";
    cin >> b;
    int sum = 0;
    if (a > b)
    {
        while (a >= b)
        {
            sum += a--;
        }
    }
    else {
        while (a <= b)
        {
            sum += a++;
        }
    }
    cout << "sum=" << sum;
    */

    /*

    Завдання 4. Користувач з клавіатури вводить числа.
    Порахувати їхню суму і вивести на екран, щойно користувач
    введе нуль програма закінчується
    

    int a, sum = 0;

    do
    {
        cout << "Введіть число: ";
        cin >> a;
        sum += a;
    } while (a != 0);

    cout << "sum=" << sum;
    */

    /*
    Завдання 1. Написати гру «Вгадай число». Програма
    загадує число в діапазоні від 1 до 500. Користувач
    намагається його вгадати. Після кожної спроби програма
    видає підказки, чи його число є більшим або меншим за
    задумане. У кінці програма видає статистику: за скільки
    спроб угадано число. Передбачити вихід за допомогою 0,
    у разі, якщо користувачеві набридло вгадувати число.
    
    srand(time(0));
    int min = 1, max = 500;
    int n = rand() % (max - min + 1) + min;
    // n = rand()%500+1;
    int a, i = 0;
    do
    {
        cout << "Введіть число: ";
        cin >> a;
        if (a > n)
        {
            cout << "Число більше";
        }
        else if (a < n) {
            cout << "Число менше";
        }
        i++;
    } while (a != 0 || a != n);
    if (a == n)
    {
        cout << "Ви вгадали число! За " << i << " спроб";
    }
    */
    
    /*
    Завдання 2. Написати програму — конвертер валют.
    Реалізувати спілкування з користувачем через меню.

    cout << "Вітаємо в конвертері валют 2007" << endl;  
    cout << "Виберіть валюту для конвертації: " << endl;
    cout << "1. Гривні" << endl;
    cout << "2. Доллари" << endl;
    cout << "3. Євро" << endl;
    int a;
    cin >> a;
    float b;
    switch (a)
    {
    case 1:
        cout << "Виберіть валюту для конвертації: " << endl;
        cout << "1. Гривні" << endl;
        cout << "2. Доллари" << endl;
        cout << "3. Євро" << endl;
        cin >> a;
        switch (a)
        {
        case 2:
            cout << "Введіть сумму для переводу: ";
            cin >> b;
            printf("Гривні->Доллари.\n%.2f Гривень -> %.2f Долларів ", b, b * 0.21);
            break;
        case 3:
            cout << "Введіть сумму для переводу: ";
            cin >> b;
            printf("Гривні->Доллари.\n%.2f Гривень -> %.2f Долларів ", b, b * 0.15);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }
    */
    
    /*
    Завдання 3. Написати програму де користувач дивиться на змагання
    двух ботів, які виграють і програють очки за наступним правилом:
    кожен бот на початку має 10 поінтів
    кожний хід починається з загадування числа від 0 до 10
    той бот що загадав число більше забирає одне очко з очків противника
    гра закінчується коли у когось з ботів буде 0
    вивід кожного ходу у форматі:
    1 раунд. Бот1 загадав 4. Бот2 загадав 2. Бот1 виграв! Бот1: 11 Бот2: 9
    */

    int bot1, bot2, score1 = 10, score2 = 10, i = 1;
    int max = 10, min = 0;

    do
    {
        bot1 = rand() % (max - min + 1) + min;
        bot2 = rand() % (max - min + 1) + min;
        if (bot1 > bot2)
        {
            score1++; score2--;
        }
        else if (bot1 < bot2) {
            score1--; score2++;
        }
        printf("%2d раунд. Бот1 загадав %2d. Бот2 загадав %2d.", i, bot1, bot2);
        printf(" %s виграв! Бот1: %2d Бот2: %2d\n", bot1 > bot2 ? "Бот1" : "Бот2", score1, score2);
        i++;
    } while (score1 > 0 && score2 > 0);
}
