Завдання 2. Написати імітацію касового апарату для
крамниці, яка торгує новорічними товарами. Касир має
вибрати товар зі списку, ввести його кількість, потім вибрати наступний товар. 
Після завершення введення вивести на екран всю суму покупки. Передбачити наявність
знижки. У списку товарів має бути не менше ніж 4 товари,
має відображатися їхня ціна та кількість на складі
■ Реалізувати можливість обслуговування декількох
клієнтів поспіль;
■ Зберігання загальної виручки крамниці;
■ Обмежити кількість товару в крамниці.

Приклад виведення
    /*
    Крамниця товарів. Виручка магазина 0 грн.
    1.Печіво ..................... 50  грн.  10  шт.
    2.Прикраса для ялинки ........ 100 грн.  160 шт.
    3.Подарункова коробка ........ 30  грн.  15  шт.
    4.Листівка "З Новим Роком!" .. 5   грн.  500 шт.

    Клієнт 1.

    Введіть товар 1: 3
    Введіть кількість товару: 5
    Є знижка на товар? 1.Так 2.Ні
    2
    До сплати: 5х30=150 грн.
    Загальна сума покупки: 150 грн.
    Додати ще один товар? 1.Так. 2.Ні
    1

    Введіть товар 2: 1
    Введіть кількість товару: 1
    Є знижка на товар? 1.Так 2.Ні
    1
    Відсоток знижки: 20
    До сплати: 1х50*20%= 40грн.
    Загальна сума покупки: 190 грн.
    Додати ще один товар? 1.Так. 2.Ні
    2
    Дякуємо за покупку! До сплати 190 грн.
    
    Крамниця товарів. Виручка магазина 190 грн.
    1.Печіво ..................... 50  грн.  9  шт.
    2.Прикраса для ялинки ........ 100 грн.  160 шт.
    3.Подарункова коробка ........ 30  грн.  10  шт.
    4.Листівка "З Новим Роком!" .. 5   грн.  500 шт.

    Клієнт 2.

    Введіть товар 1: ||
    
    */
}