#include <iostream>

/*
Задача 1. Створити функцію що приймає динамічний масив, його розмір та деяке число x та
повертає новий масив на один менше з якого було видалено перше таке число x. Якщо x не 
зустрілося в масиві, то масив повертається ідентичний першому.

Задача 2. Створити функцію що приймає два динамічних масива A, B, та їх відповідні розміри
та повертає новий масив в якому є всі елементи з першого та другого масивів.

Задача 3. Створити функцію що приймає динамічний масив, його розмір та виводить на екран 
новий!!! масив з видаленими від'ємними елементами. 

*/

int main()
{
    std::cout << "Hello World!\n";
}
