#include <iostream>
using namespace std;

// Урок 39. Багатовимірна динамічні масиви

int main()
{
    int m;
    cin >> m;
    int n;
    cin >> n;
    int** arr = new int*[m]; // створення місць під майбутні одновимірні масиви (рядки)
    for (int i = 0; i < m; i++)
    {
        arr[i] = new int[n]; // виділеня місць під самі елементи масивів (стовбці, елементи)
    }
    // створення ПУСТОГО двовимірного динамічного масиву

    int a = 0;
    for (int i = 0; i < m; i++)
    {
        for ( int j = 0; j < n; j++)
        {
            arr[i][j] = a; a++;
        }
    }
    //заповнення двовимірного масива числами по порядку

    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < n; j++)
        {
            cout << arr[i][j] << ' ';
        }
        cout << '\n';
    }
    //виведення двовимірного динамічного масиву
}
