#include <iostream>

int main()
{
   /*Задачі
   
   Задача 3. Створити функцію, що приймає показчик на елемент та масив
   і повертає індекс цього елемента в масиві.

   Задача 4. Створити функцію, що приймає показчик на масив і звільняє пам'ять
   цього масиву.

   Задача 5. Створити функцію, що приймає показчик на масив та його розмір та 
   сортує масив.

   Задача 6. Створити функцію, що приймає показчик на прямокутний 
   двовимірний масив та показчик на останній елемент масиву. Порахувати розмір
   масиву. (сумарна кількість елементів)   
   
   
   
   
   
   */
}
