/* Урок 40. Показчики */
#include <iostream>
using namespace std;

void add(int* px) {
    *px = *px + 1;
   //x = x + 1;
    // * -> унарний оператор розіменування
    // *a -> розіменувати змінну "а", ("а" це показчик)
    // результат дії "*px" та змінна "x" з точки зору роботи коду одне
    // і те саме
}

int main()
{
    // Показчик - це змінна, яка замість значення зберігає
    // адресу в пам'яті для іншої зміної. Його значення
    // зберігає місце в пам'яті. (окремий тип даних)
    int x = 10;
    int* px = &x; // px - це показчик що зберігає місце в пам'яті
                  // адресу змінної х
    // & -> унарний оператор взяття адреси
    // &a -> взяти адресу із змінної "a"
    // + -> бінарний оператор суми
    // a+b -> порахувати сумму "a" та "b"
    add(px);
    cout << x;
}
