#include <iostream>

int main()
{
	/*
	Задача 1. Напишіть програму на C++, яка приймає два масиви 
	статичних цілих 3x3 як вхідні дані та повертає добуток двох 
	матриць як третій масив статичних цілих 3x3.

	Задача 2. Напишіть програму на C++, яка приймає масив статичних 
	цілих чисел 4x4 як вхідні дані та повертає максимальний елемент у масиві.

	Задача 3. Напишіть програму C++, яка приймає двовимірний статичний 
	масив цілих чисел розміром 3x3 як вхідні дані та повертає 
	транспонування матриці (тобто рядки стають стовпцями і навпаки).

	Задача 4. Напишіть програму на C++, яка приймає масив статичних 
	цілих 3x3 як вхідні дані та повертає новий масив статичних цілих 
	3x3, що містить лише верхні трикутні елементи (тобто елементи над 
	головною діагоналлю).

	Задача 5. Напишіть програму на C++, яка приймає масив статичних 
	цілих чисел 3x3 як вхідні дані та повертає інформацію про те, є 
	масив симетричним чи ні. Матриця є симетричною, якщо вона дорівнює 
	її транспонуванню.

	Задча 6. Зробити масив символів 100х15. Заповнити масив пробілами і в рандомному
	місці поставить знак '*'. Реалізувати алгоритм який повторюється нескінченно:
	1. system("cls");
	2. cin >> x
	3. якщо х = 1 то зірочка має переміститись вліво на 1 елемент в масиві
	4. якщо х = 2 то зірочка має переміститись вниз на 1 елемент в масиві
	5. якщо х = 3 то зірочка має переміститись вправо на 1 елемент в масиві
	6. якщо х = 4 то зірочка має переміститись ввверх на 1 елемент в масиві
	7. вивести весь масив

	Задача 7. Створити статичний тривимірний масив 4х4х4 з цілих чисел та знайти суму всіх його елементів.

	Задача 8. Створити двовимірний масив 10х10 заповнити випадковими чистами вивести на екран.
	Відсортувати кожен стовпчик будь-яким способом в порядку зростання. Вивести результат.
	*/
}
