#include <iostream>
#include <Windows.h>
using namespace std;

int main()
{
	int const w = 15, h = 5; 
	// w - ширина масиву/стовпчики (довина рядка)
	// h - висота масиву/рядочки (кількість рядків)

	int arr[h][w];

	for (int i = 0; i < h; i++) // зовнішній цикл перебору рядків масиву
	{
		for (int j = 0; j < w; j++) // внутрішній цикл перебору елементів рядка
		{
			// генерація випадкових чисел в кожний елемент масиву
			arr[i][j] = rand() % 90+10; 
			cout << arr[i][j] << ' ';
		}
		cout << '\n';
	}
}