#include <iostream>
#include <Windows.h>
using namespace std;

int main()
{
	/*
	Завдання 2. Написати імітацію касового апарату для
	крамниці, яка торгує новорічними товарами. Касир має
	вибрати товар зі списку, ввести його кількість, потім вибрати наступний товар. 
	Після завершення введення вивести на екран всю суму покупки. Передбачити наявність
	знижки. У списку товарів має бути не менше ніж 4 товари,
	має відображатися їхня ціна. Передбачити неправильно
	введені дані.
	- Реалізувати можливість обслуговування декількох
	клієнтів поспіль;
	- Зберігання загальної виручки крамниці;
	- Обмежити кількість товару в крамниці.
	*/
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    int money = 0;
    int g1 = 10, g2 = 160, g3 = 15, g4 = 500;
    int client = 1;

    int n, a, d, v, p;
    float s;
NewClient:
    cout << "Крамниця товарів. Виручка магазина " << money << " грн.\n";
    printf("1.Печіво ..................... %-3d грн. %-3d шт.\n", 50, g1);
    printf("2.Прикраса для ялинки ........ %-3d грн. %-3d шт.\n", 100, g2);
    printf("3.Подарункова коробка ........ %-3d грн. %-3d шт.\n", 30, g3);
    printf("4.Листівка \"З Новим Роком!\" .. %-3d грн. %-3d шт.\n", 5, g4);
    cout << "\nКлієнт " << client << ".\n";
NewGoods:
    cout << "Введіть товар: ";
    cin >> n;
    p = n == 1 ? 50 : n == 2 ? 100 : n == 3 ? 30 : 5;
    cout << "Введіть кількість товару:";
    cin >> a;
    cout << "Є знижка на товар? 1.Так 2.Ні\n";
    cin >> v;
    if (v == 1) { goto WithDiscount; }
    s = p * a;
    printf("До сплати: %dх%d=%.2f грн.", p, a, s);
    goto Question2;
WithDiscount:
    cout << "Відсоток знижки: ";
    cin >> d;
    s = p * a - p * a * (d / 100.0f);
    printf("До сплати: %dх%d*%d%c=%.2f грн.\n", p, a, d, '%', s);
Question2:
    cout << "Додати ще один товар? 1.Так. 2.Ні\n";
    cin >> v;
    if (v == 1) { goto NewGoods;}
    client++;
    cout << "Дякуємо за покупку! До сплати " << s << " грн.\n";
    money += s;
    goto NewClient;
	/*
	Крамниця товарів. Виручка магазина 0 грн.
    1.Печіво ..................... 50  грн.  10  шт.
    2.Прикраса для ялинки ........ 100 грн.  160 шт.
    3.Подарункова коробка ........ 30  грн.  15  шт.
    4.Листівка "З Новим Роком!" .. 5   грн.  500 шт.

    Клієнт 1.

    Введіть товар 1: 3
    Введіть кількість товару: 5
    Є знижка на товар? 1.Так 2.Ні
    2
    До сплати: 5х30=150 грн.
    Загальна сума покупки: 150 грн.
    Додати ще один товар? 1.Так. 2.Ні
    1

    Введіть товар 2: 1
    Введіть кількість товару: 1
    Є знижка на товар? 1.Так 2.Ні
    1
    Відсоток знижки: 20
    До сплати: 1х50*20%= 10грн.
    Загальна сума покупки: 160 грн.
    Додати ще один товар? 1.Так. 2.Ні
    2
    Дякуємо за покупку! До сплати 160 грн.
    
    Крамниця товарів. Виручка магазина 160 грн.
    1.Печіво ..................... 50  грн.  9  шт.
    2.Прикраса для ялинки ........ 100 грн.  160 шт.
    3.Подарункова коробка ........ 30  грн.  10  шт.
    4.Листівка "З Новим Роком!" .. 5   грн.  500 шт.

    Клієнт 2.

    Введіть товар 1: ||
	*/
}