#include <iostream>
using namespace std;

/*
Задача 1. Написати функцію та визначити її через шаблон, яка приймає 3 однакових значення
будь-якого типу даних і повертає найбільше з них.

Задача 2. Написати функцію та визначити її через шаблон, яка приймає 3 однакових значення 
будь-якого типу даних a,b,c і відповідає на питання a < b < c. (чи знаходиться b між a та с).

Задача 3. Написати функцію та визначити її через шаблон, яка приймає 3 різних значення 
будь-яких типів даних і повертає добуток цих значень в форматі double.

Задача 4. Написати функцію та визначити її через шаблон, яка приймає масив з 5 значень будь-яких 
типів даних та виводить їх на екран у вигляді таблички.
--------------------------
| x0 | x1 | x2 | x3 | x4 |
--------------------------

Задача 5. Написати функцію та визначити її через шаблон, що шукає суму всіх значень від 0 до 
значення будь-якого типу що було їй передано і повертає її у форматі double.

Задача 6. Написати функцію та визначити її через шаблон, що приймає 4 значення будь-яких типів для 
координат двух точок x0, y0, x1, y1 та повертає відстань між точками у форматі double.

Задача 7. Напишіть функцію та визначте її через шаблон, яка приймає массив будь-якого типу 
даних на 10 елементів і число, і повертає виводить массив з усіма елементами, помноженими на задане число.

Задача 8. Напишіть функцію та визначте її за допомогою шаблону, яка приймає массив будь-якого типу 
даних на 10 елементів і виводить массив з видаленими дублікатами.

Задача 9. Реалізуйте рекурсивну функцію, яка приймає масив цілих чисел і повертає суму всіх елементів у масиві

Задача 10. ***
Напишіть рекурсивну функцію, яка приймає масив цілих чисел і повертає кількість 
різних пар елементів у масиві, які в сумі дають задане цільове значення. 
Наприклад, якщо вхідний масив — [3, 4, 2, 5, 1], а цільове значення — 6, 
функція має повернути 2 (пари [3, 3] і [4, 2] у сумі дають 6) .

*/

int sum(int arr[10], int i, int sum1) {
    if (i < 10)
    {
        sum1 += sum(arr, ++i, sum1);
    }
    return sum1;
}

int main()
{
    int arr[10] = { 1,1,1,1,1,1,1,1,1 };
    std::cout << sum(arr, 0, 0);
}
