#include <iostream>
using namespace std;
/*
    Задача 1. Написати програму, в якій користувач вводить певне
    ціле число n. Програма створює масив довжиною n та заповнює
    його за формулою arr[i] = 2*i+1. Після чого весь масив виводить
    на екран.
    for (int i = 0; i < n; i++)
    {
        arr[i] = 2 * i + 1;
    }

*/
template <typename T>
void printArray(T* arr, int n) {
    for (int i = 0; i < n; i++) { cout << arr[i] << ' '; } cout << '\n';
}
template <typename T>
void fillArray(T* arr, int n) {
    for (int i = 0; i < n; i++) { cin >> arr[i]; }
}
template <typename T>
bool isUnique(T* arr, int n, int j) {
    for (int i = 0; i < n; i++)
    {
        if (arr[i] == arr[j] && i != j)
        {
            return false;
        }
    }
    return true;
}
template <typename T>
void bubbleSort(T* arr, int n) {
    for (int i = 0; i < n - 1; i++) {
        for (int j = 0; j < n - i - 1; j++) {
            if (arr[j] > arr[j + 1]) {
                swap(arr[j], arr[j + 1]);
            }
        }
    }
}
template <typename T>
bool isSymetric(T* arr, int n) {
    for (int i = 0; i < n/2; i++)
    {
        if (arr[i] != arr[n-i-1])
        {
            return false;
        }
    }
    return true;
}
/*
    Задача 2. Написати програму в якій користувач вводить певне
    ціле число n. Програма послідовно просить написати значення
    в масив розміром n. Після чого програма аналізує масив і формує
    новий в якому є тільки кожен третій елемент оригінального масиву
    після чого виводить новий масив на екран.
    for (int i = 0; i < n; i++)
    {
        cin >> arr[i];
    }
    int* arr2 = new int[n / 3];
    for (int i = 0; i < n; i++)
    {
        if (i % 3 == 0)
        {
            arr2[(i-1)/3] = arr[i];
        }
    }
*/
/*
    Задача 3. Написати програму в якій користувач вводить певне
    ціле число n. Програма послідово просить написати значення
    в масив розміром n. Після чого програма аналізує масив і формує
    новий в якому є тільки унікальні елементи оригінального масиву
    (видаляє повторення) після чого виводить новий масив на екран.

    int new_n = 0;

    for (int i = 0; i < n; i++) { if (isUnique(arr, n, i)) { new_n++; } }

    int* arr2 = new int[new_n];
    int i2 = 0;
    for (int i = 0; i < n; i++)
    {
        if (isUnique(arr,n,i))
        {
            arr2[i2] = arr[i]; i2++;
        }
    }
*/
/*
    Завдання 4. Написати програму, в яку користувач вводить певний
    ціле число n. Програма створює два масиви довжиною n і заповнює їх
    за формулою arr1[i] = i+1 та arr2[i] = n-i. Після цього програма
    виводить нові масиви на екран кожний в новому рядку.
    int* arr2 = new int[n];
    for (int i = 0; i < n; i++)
    {
        arr[i] = i + 1;
        arr2[i] = n - i;
    }
*/
/*
    Завдання 5. Напишіть програму, в яку користувач вводить певний
    ціле число n. Програма послідово просить написати значення
    в масив розміром n. Після цього програма сортує масив у порядку зростання
    а потім виводить отриманий масив на екран.
*/
/*
    Завдання 6. Напишіть програму, в яку користувач вводить певний
    ціле число n. Програма послідово просить написати значення
    в масив розміром n. Після цього програма перевіряє, чи є масив
    симетричним (це означає, що перший і останній елементи рівні, другий
    і передостанній елементи рівні тощо). Якщо масив симетричний,
    програма виведе про це повідомлення. В іншому випадку програма
    створює новий масив, що складається з елементів вихідного масиву
    в зворотному порядку і відображає новий масив на екрані.
    */
int main()
{
    int n;
    cin >> n;

    int* arr = new int[n];
    fillArray(arr, n);
    if (isSymetric(arr,n))
    {
        cout << "Symetric";
    }
    else {
        int* arr2 = new int[n];
        for (int i = 0; i < n; i++)
        {
            arr2[i] = arr[n - i - 1];
        }
        printArray(arr2, n);
    }
}
