
#include <iostream>
using namespace std;
int main()
{
    /*Задачі
    
    Завдання 1. Написати функцію, яка приймає масив цілих чисел і його розмір і повертає 
    вказівник на найменший елемент масиву.

    Завдання 2. Створіть функцію, яка приймає масив символів і його розмір і повертає 
    покажчик на перше входження вказаного символу. Якщо символ не знайдено в масиві, 
    поверніть нульовий покажчик.

    Завдання 3. Створіть функцію, яка приймає два покажчики на цілі змінні та міняє 
    місцями значення, на які вони вказують. Функція не повинна нічого повертати, 
    але повинна змінювати значення в місцях пам’яті, на які вказують вхідні покажчики.

    Завдання 4. Створіть функцію, яка приймає вказівник на масив цілих чисел і його розмір, 
    а також повертає суму всіх елементів масиву.

    Завдання 5. Створіть функцію, яка приймає вказівник на рядок і виводить кожен символ 
    рядка на новому рядку.

    Задача 6. Створить функцію що приймає показчик на показчик та змінює данні на які вказує
    показчик на який вказує переданий показчик збільшуючи його на 1.
    */
}
