#include <iostream>
using namespace std;
int main()
{
    // 3 способи створення СИРИХ рядків (масиви символів з мови С)
    char str1[] = "";               // '\0' -> "" 1B
    const char* str2 = "Hello";     // 'H','e','l','l','o','\0' -> "Hello" 6B
    char* str3 = str1;              // показчик на масив символів може прийняти статичний масив

    // str1 = "";                   // статичні масиви не можна змінювати, тільки елементи
    // str1[0] = 'a';
    // delete[] str3;               // без втрат пам'яті звільняємо місце попереднього масива
    str2 = "World";                 // динамічний масив констант можна змінити, але з втратою пам'яті

    cout << str2 << endl;           // виведення рядка на екран

    char* str4 = new char[50];      // пустий рядок певної довжини
    fgets(str4, 50, stdin);         // введення інформації в пустий рядок за допомогою консолі
    // cin >> str4;                 // НЕ МОЖНА використовувати пробіл (рядок не запишеться повністю)

    //strcmp(); // НЕРЕГІСТРОчутлива (великі і малі літери вважаються одним символом)
    //stricmp();// РЕГІСТРОчутлива (великі та малі літери сприймаються різними символами)
}