#include <iostream>
#include <Windows.h>
using namespace std;
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    /* Завдання 1. Вивести на екран усі числа від нуля
    до введеного користувачем числа.

    Завдання 2. Користувач вводить дві межі діапазону,
    вивести на екран усі числа з цього діапазону. Передбачити,
    щоб користувач міг вводити межі діапазону в довільному
    порядку.

    Завдання 3. Користувач вводить дві межі діапазону.
    Порахувати суму всіх чисел діапазону.

    Завдання 4. Користувач з клавіатури вводить числа.
    Порахувати їхню суму і вивести на екран, щойно користувач
    введе нуль
    */
    //1
    /*
    int x;
    cout << "Введіть число:";
    cin >> x;

    int y = 0;
    while (y <= x)
    {
        cout << y << ' ';
        y++;
    }*/
    //2
    /*int a, b;
    cout << "Введіть два числа через пробіл: ";
    cin >> a >> b;
    if (a < b)
    {
        while (a <= b)
        {
            cout << a++ << ' ';
        }
    }
    else
    {
        while (a >= b)
        {
            cout << a-- << ' ';
        }
    }*/
    //3
    /*int a, b;
    cout << "Введіть два числа через пробіл: ";
    cin >> a >> b;
    int sum = 0;
    while (a <= b)
    {
        sum += a++;
    }
    cout << sum;*/
    //4
    /*int sum = 0;
    int x;
    do
    {
        cin >> x;
        sum += x;
    } while (x!=0);
    cout << sum;*/
}