#include <iostream>
#include <Windows.h>
using namespace std;
int main()
{
    srand(time(0));
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
   
    /*
    Завдання 1. Написати гру «Вгадай число». Програма
    загадує число в діапазоні від 1 до 500. Користувач 
    намагається його вгадати. Після кожної спроби програма
    видає підказки, чи його число є більшим або меншим за
    задумане. У кінці програма видає статистику: за скільки
    спроб угадано число. Передбачити вихід за допомогою 0, 
    у разі, якщо користувачеві набридло вгадувати число.

    Завдання 2. Написати програму — конвертер валют. 
    Реалізувати спілкування з користувачем через меню.

    Завдання 3. Написати програму де користувач дивиться на змагання
    двух ботів, які виграють і програють очки за наступним правилом:
    кожен бот на початку має 10 поінтів
    кожний хід починається з загадування числа від 0 до 10
    той бот що загадав число більше забирає одне очко з очків противника
    гра закінчується коли у когось з ботів буде 0
    вивід кожного ходу у форматі:
    1 раунд. Бот1 загадав 4. Бот2 загадав 2. Бот1 виграв! Бот1: 11 Бот2: 9
    */


}