#include <iostream>
#include <Windows.h>
using namespace std;
int main()
{    
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    /*
    for i in range(10):
    --->тіло цикла
    
    for(int i=0; i < 10; i++){ тіло цикла }

    */

    // Задача 1. Вивести табличку множення чисел 10х10
    /*int x = 2; 
    while (x < 13)
    {
        printf("%2dx%-2d=%3d\n", x, y, x * y);
        x++;
    }*/
    // створення змінної для лічильника
    // умова завершення циклу
    // дія в кінці циклу(часто збільшення/зміна лічильника)
    /*for (int x = 2; x < 13; x++)
    {
        printf("%2dx%-2d=%3d\n", x, y, x * y);
    }*/
    // нескіченний for



}