#include <iostream>
using namespace std;

// Задача 1. Створити функцію, що приймає посилання на змінну з цілим числом та змінює
// це число поділивши його напвіл

int f1(int a) {
    return a / 2;
}

int main()
{
    std::cout << "Hello World!\n";
}