#include <iostream>
using namespace std;

// strchr -> шукає в рядку місцезнаходження певного символа, та повертає показчик на нього
// strrchr -> шукає в рядку місцезнаходження певного символа, та повертає показчик на нього
//            з кінця
// strstr

// Задача 1. Знайти довжину першого речення в рядку, що ввів користувач. Використовуючи
// strchr.


int main()
{
    char* str = new char[100];
    fgets(str, 100, stdin);
    char options[] = ".!?";
    // різниця двух адрес(показчиків) є відстань в пам'яті, що відділяє ці два показчика
    // в масивах, ми можемо дізнатися індекс елемента віднімаючи показчик на елемент від
    // показчика на перший елемент
    
    int min = INT32_MAX;
    for (int i = 0; i < 4; i++)
    {
        char* address = strchr(str, options[i]);
        int index = address - str;
        if (index > 0 && index < min) { min = index; }
    }
    cout << min;
}