#include <iostream>

int main()
{
    /*
    * Задачі
    * 
    * Задача 4. Створити структуру, що зберігає інформацію про координати кінця 
    * вектора. Написати функцію що приймає вектор і повертає його довжину.
    * 
    * Задача 5. Створити структуру, що зберігає інформацію про координати кінця 
    * вектора. Написати функцію що приймає два вектора і повертає вектор, що є
    * сумою цих двох векторів.
    * 
    * Задача 6. Створити структуру, що зберігає інформацію про прямокутний
    * трикутник (два катета та гіпотенуза). Написати функцію, що рахує площу 
    * трикутника і виводить її на екран.
    * 
    * Задача 7. Написати структуру, що зберігає інформацію про прямокутник (
    * координата верхнього лівого кута прямокутника, довжина та ширина). Написати
    * функцію, що заповнює випадковими числами структуру та виводить значення на 
    * екран.
    * 
    * Задача 8. Створити структуру в якій зберігається інформація про дату (день,
    * місяць, рік). Написати функцію що знаходить різницю в днях між двома датами.
    * 
    * Задача 9. Використати структуру з задачі 8. Написати функцію, що повертає
    * який це день в році з початку року.
    * 
    * Задача 10. Використати структуру з задачі 7. Написати функцію, що пише всі
    * характеристики трикутника у вигляді таблички:
    * a : (довжина катета) b: (довжина катета) с: (довжина гіпотенузи)
    * sin L : (сінус кута альфа)    sin B : (сінус кута бета)
    * cos L : (косінус кута альфа)  cos B : (косінус кута бета)
    * L : (кут альфа в радіанах)  L` : (кут альфа в градусах)
    * B : (кут бета в радіанах)   B` : (кут бета в градусах)
    */
}
