#include <iostream>
using namespace std;

/*доступ до масиву через показчик(арифметика показчиків)*/

int main()
{
    int n;
    cin >> n;
    int* arr = new int[n];
    for (int i = 0; i < n; i++)
    {
        arr[i] = rand() % 10 + 1;
        cout << arr[i] << ' ';
    }

    int* p5 = &arr[4];  // адреса 5 елементу (5-1 бо відлік від 0)
    int* p_5 = arr + 4; // адреса 5 елементу (5-1 бо відлік від 0)
    *arr = 0;           // замінити перший елемент на 0
    *(arr + 1) = 5;     // замінити другий елемент на 5
    int a = *arr;       // записати в "а" значення першого елементу
    int b = *(arr + 1); // записати в "b" значення другого елементу
    int c = *arr + 5;   // записати в "с" сумму першого елемента і числа 5
}
