#include <iostream>

/*
Задачі.

Задача 1. Створити програму що записує випадково створений 
двовимірний масив чисел в файл,а потім считує його та обчислює 
сумму всіх чисел.

Задача 2. Створити програму що записує у файл введений користувачем текст
а потім зчитує його з цього файлу та виводить на екран так, щоб кожне слово
було з нового рядка.

Задача 3. Створити функцію що приймає 
*/
int main()
{
    std::cout << "Hello World!\n";
}
