#include <iostream>
#include <Windows.h>
using namespace std;

int main()
{
    srand(time(NULL));

    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    // Задача 1. Користувач вводить число. Програма створює
    // випадкове число і до поки користувач не вгадає число
    // програма починається спочатку

    int x , y;
    do {
        cout << "Введіть число від 1 до 99: ";
        cin >> x;
        y = rand() % 99 + 1;
    } while (x != y);
    // do while -> цикл, що обов'язково виконує тіло циклу один 
    // раз незалежно від умови
    // while -> цикл, що обов'язково перед початком виконання
    // тіла цикла перевірить свою умову

    /* Завдання 1. Вивести на екран усі числа від нуля 
    до введеного користувачем числа.
        
    Завдання 2. Користувач вводить дві межі діапазону, 
    вивести на екран усі числа з цього діапазону. Передбачити,
    щоб користувач міг вводити межі діапазону в довільному
    порядку.

    Завдання 3. Користувач вводить дві межі діапазону. 
    Порахувати суму всіх чисел діапазону.

    Завдання 4. Користувач з клавіатури вводить числа. 
    Порахувати їхню суму і вивести на екран, щойно користувач
    введе нуль
    */
}
