#include <iostream>
using namespace std;


/*
* Задачі: Створити двовимірний динамічний масив. 
* 
* Задача 1. Видалити рядок з найменшою сумою.
* 
* Задача 2. Додати рядок в кінець масива що містить суму по стовпчику.
* 
* Задача 3. Дзеркально відобразити масив по вертикалі.
* 
* Задача 4. Повернути масив на 90° за годинниковою стрілкою.
* 
* Задача 5. Видалити всі стовпчики в яких є число 0.
*/


int main()
{
    std::cout << "Hello World!\n";
}