#include <iostream>
using namespace std;
/*Двовимірні динамічні масиви. Масиви трикутні, масиви слів. */

int main()
{
    /* Задача 1. Створити динамічний масив nXm елементів, який буде складатися з 
    чисел по порядку від 0. Змінити знак у всіх парних елементів на протилежний*/
    int n, m; 
    cin >> n >> m; // n-> к-сть рядків, m-> к-сть стовпчиків
    int** arr = new int*[n]; // визначення масиву показчиків(створення рядків)
    for (int i = 0; i < n; i++) 
    {
        arr[i] = new int[m]; // виділення пам'яті під рядки(створення "стовпчиків")
        for (int j = 0; j < m; j++) 
        {
            arr[i][j] = i*m+j; // запис значення в кожний елемент масива
            cout << arr[i][j] << ' '; // вивід кожного елемента в рядках масива 
        }
        cout << endl; // завершення кожного рядка перенесенням на новий рядок
    }

    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            if (arr[i][j] % 2 == 0)
            {
                arr[i][j] *= -1;
            }
        }
    }
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            cout << arr[i][j] << ' ';
        }
        cout << endl;
    }
}