#include <iostream>

int main()
{
    /*
    Задача 1. Написати програму, в якій користувач вводить певне
    ціле число n. Програма створює масив довжиною n та заповнює
    його за формулою arr[i] = 2*i+1. Після чого весь масив виводить
    на екран.

    Задача 2. Написати програму в якій користувач вводить певне
    ціле число n. Програма послідовно просить написати значення
    в масив розміром n. Після чого програма аналізує масив і формує
    новий в якому є тільки кожен третій елемент оригінального масиву
    після чого виводить новий масив на екран.

    Задача 3. Написати програму в якій користувач вводить певне
    ціле число n. Програма послідово просить написати значення 
    в масив розміром n. Після чого програма аналізує масив і формує
    новий в якому є тільки унікальні елементи оригінального масиву
    (видаляє повторення) після чого виводить новий масив на екран.
    
    Завдання 4. Написати програму, в яку користувач вводить певний
    ціле число n. Програма створює два масиви довжиною n і заповнює їх
    за формулою arr1[i] = i+1 та arr2[i] = n-i. Після цього програма 
    виводить нові масиви на екран кожний в новому рядку.

    Завдання 5. Напишіть програму, в яку користувач вводить певний
    ціле число n. Програма послідово просить написати значення 
    в масив розміром n. Після цього програма сортує масив у порядку зростання
    а потім виводить отриманий масив на екран.

    Завдання 6. Напишіть програму, в яку користувач вводить певний
    ціле число n. Програма послідово просить написати значення 
    в масив розміром n. Після цього програма перевіряє, чи є масив
    симетричні (це означає, що перший і останній елементи рівні, другий 
    і передостанній елементи рівні тощо). Якщо масив симетричний, 
    програма виведе про це повідомлення. В іншому випадку програма
    створює новий масив, що складається з елементів вихідного масиву 
    в зворотному порядку і відображає новий масив на екрані.
    */
}
