#include <iostream>
using namespace std;
int main()
{
    /* 
    Задача 1. Створити функцію що приймає нецілі значення катетів "a","b" і рахує 
    гіпотенузу "c" по теоремі Піфагора. Створити ще одну функцію з іншою назвою 
    що шукала б катет "a" по "b" та "c"

    Задача 2. Створити функцію що приймає нецілі значення початкової швидкості "v0", 
    часу "t" і рахує відстань "l" скільки проїхав об'єкт. 
    по формулі l=v0*t. 
    
    Задача 3. Створити функцію, що використовувала б першу функцію щоб відповісти true або 
    false на питання "Чи доїхав би об'єкт до місця на відстані "l", якщо їхав зі швидкістю "v0" час "t"?" 
    по формулі l=v0*t.

    Задача 4. Створити функцію, що відповідала би double часом на питання "Скільнки часу треба 
    об'єкту щоб доїхати на відстань "l" зі швидкістю "v0"?".
    по формулі l=v0*t.

    Задача 5. Створити функцію що відповідала би double часом на питання "Скільнки треба швидкість 
    "v0" об'єкту щоб доїхати на відстань "l" зa час "t"?".
    по формулі l=v0*t.

    Задача 6. Створити функцію, що приймає діапазон [a;b] та крок i та виводить на екран 
    значення y для функції x^2 у вигляді таблиці
    для a = -2; b = 4; i = 1;
    ---------------------------------
    | x | -2| -1|  0|  1|  2|  3|  4|
    +---+---+---+---+---+---+---+---+
    | y |  4|  1|  0|  1|  4|  9| 16|
    ---------------------------------
    */

    double a = 4.0;
    cout << sqrt(a);
    cout << pow(a, 0.5);
}