#include <iostream>
using namespace std;

// Задача 3. Створити функцію що приймає масив цілих чисел та його розмір
// та повертає показчик на найбільший елемент масиву.

int* getMaxPointer(int* arr, int n) {
    int* p = nullptr; // "пустий показчик без значення"(умовно)
                      // спосіб задати умовно невизначене значення показчику
                      // для того, щоб програма давала його використовувати навіть
                      // за умови його невизначення на якусь конкретну адресу
    int j = 0;
    for (int i = 1; i < n; i++)  {if (arr[i] > arr[j]) { j = i; } }
    p = &arr[j];// записуємо адресу НАЙБІЛЬШОГО елемента масива по знайденому індексу
    return p;
}

int main()
{
    int n;
    cin >> n;
    int* arr = new int[n];
    for (int i = 0; i < n; i++)
    {
        arr[i] = rand() % 99 + 1;
        cout << arr[i] << ' ';
    }cout << '\n';


    cout << getMaxPointer(arr, n);
}