#include <iostream>
#include <Windows.h>
using namespace std;


// Функція - це іменований фрагмент коду, що може бути викликаний
// та використаний багато разів в основному коді 

// ТИП ЗНАЧЕННЯ ЩО Є РЕЗУЛЬТАТОМ ФУНКЦІЇ - void - функція не повертає значення
// НАЗВА ФУНКЙЦІЇ - Line
// ПАРАМЕТРИ ЩО ПЕРЕДАЮТЬСЯ ФУНКЦІЇ - (int n) - дужки
// один параметр який є цілим числом - int n - сама змінна
// ТІЛО ФУНКЦІЇ - {} - код що виконується при виклику функції
void Line(int n) {
	for (int i = 0; i < n; i++)
	{
		cout << '-';
	}
	cout << '\n';
}

int main()
{
	cout << "Hello world!" << endl;
	Line(10);
	cout << "My name is Sasha!" << endl;
}
