#include <iostream>


int main()
{
    /*
    Задача 1. Напишіть функцію, яка приймає два цілих аргументи 
    та повертає їх суму.

    Задача 2. Напишіть функцію, яка приймає цілочисельний 
    аргумент і повертає true, якщо ціле число є парним, і 
    false в іншому випадку.

    Задача 3. Напишіть функцію, яка приймає подвійний аргумент, 
    що представляє температуру в градусах Цельсія, і повертає 
    відповідну температуру в градусах Фаренгейта за допомогою 
    формули F = (9/5) * C + 32.

    Задача 4. Напишіть функцію що приймає char[10] слово та рахує кількісь
    голосних букв в слові. Відповідь має бути цілим додатнім числом якщо там є 
    голосні та 0 якщо їх немає.

    Задача 5. Напишіть функцію, яка приймає цілочисельний аргумент 
    і повертає факториал цілого числа. Факторіал натурального 
    числа n є добутком усіх натуральних чисел від 1 до n. Наприклад, 
    факториал числа 5 дорівнює 5 * 4 * 3 * 2 * 1 = 120.

    Задача 6. Послідовність Фібоначчі: напишіть функцію, яка 
    приймає ціле число n як вхідні дані та повертає n-е число 
    Фібоначчі. Послідовність Фібоначчі визначається наступним 
    чином: перші два числа дорівнюють 0 і 1, а кожне наступне 
    число є сумою двох попередніх. Наприклад, перші 10 чисел у 
    послідовності - це 0, 1, 1, 2, 3, 5, 8, 13, 21 і 34.

    Задача 7. Розкладання на прості множники: напишіть функцію, 
    яка приймає ціле число n як вхідні дані та виводить його 
    прості множників. Простий множник — це просте число, яке 
    точно ділить n. Наприклад, прості множники числа 20 дорівнюють 
    2 і 5. Ви можете вважати, що n є додатним цілим числом.  

    Задача 8. Реалізуйте функцію, яка приймає відсортований масив цілих 
    чисел на 10 елементів і цільове ціле число та повертає індекс цільового 
    цілого числа в масиві. Якщо число наявно в масиві, то повернути індекс числа, 
    якщо ні то -1.
    */
}
