#include <iostream>

int main()
{
    /*
    Задача 1. Напишіть функцію, яка приймає масив цілих 
    чисел і повертає суму всіх чисел у масиві.

    Задача 2. Напишіть функцію, яка приймає два масиви 
    цілих чисел і виводить новий масив, який містить лише елементи, 
    присутні в обох масивах.

    Задача 3. Напишіть функцію, яка приймає масив цілих 
    чисел і виводить новий масив, який містить лише парні числа вихідного масиву.

    Задача 4. Напишіть функцію, яка приймає двовимірний масив цілих 
    чисел і повертає індекс найменшого числа в масиві.

    Для кожної задачі зробити перегрузку для double чисел. І прописати прототип з 
    коментарем типу:
    int f1(...);    // задача 1 - int 
    double f1(...); // задача 1 - double
    
    */
}
