#include <iostream>
using namespace std;

/*Вирішення задач за 20.04*/
// Задача 3. Створити функцію, що приймає показчик на елемент та масив
// і повертає індекс цього елемента в масиві.

//Задача 4. Створити функцію, що приймає показчик на масив і звільняє пам'ять
// цього масиву.

//Задача 5. Створити функцію, що приймає показчик на масив та його розмір та 
//сортує масив.

//Задача 6. Створити функцію, що приймає показчик на прямокутний 
// двовимірний масив та показчик на останній елемент масиву. Порахувати розмір
// масиву. (сумарна кількість елементів)

int f3(int* arr, int* elem) { return elem - arr; }

void f4(int* arr) { delete[] arr; }

void f5(int* arr, int n) {
	for (int i = 0; i < n - 1; i++)
	{
		for (int j = i + 1; j < n; j++)
		{
			if (*(arr + i) > *(arr + j))
			{
				int temp = *(arr + i);
				*(arr + i) = *(arr + j);
				*(arr + j) = temp;
			}
		}
	}
}

int f6(int* arr, int* last) {
	return (last - arr)+1;
}

int main()
{

}
