#include <iostream>
#include <Windows.h>
using namespace std;
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // %d    -> цілі числа типу int, short          12312312
    // %f    -> дробові числа типу float            10.123f
    // %lf   -> дробові числа типу double           12.1231231231
    // %ld   -> цілі числа типу long long           1238127481274128
    // %c    -> ціле число типу char, або символ    ' '
    // %s    -> рядок                               "текст фівфів"

    // %10d  -> цілі числа виводяться в полі з 10 символів 
    //          (ПЕРЕД числом буде необхідна к-сть пробілів)
    //          (якщо поля недостатньо для виводу (число більше за поле)
    //          то розмір поля ігнорується)
    // %.5f  -> обмеження дробової частини нецілого числа на 5 розрядів
    //          (якщо розрядів менше ніж обмеження, замість цифр буде 0)
    // 
    // %-10d -> цілі числа виводяться в полі з 10 символів
    //          (ПІСЛЯ числа буде необхідна к-сть пробілів)
    
    // Задача 2. Користувач вводить одне число, програма виводить таблицю
    // множення цього числа на всі числа від 2 до 10, рівно

    // Ctrl+K+C -> закоментувать виділений фрагмент
    // Ctrl+K+U -> розкоментувать виділений фрагмент

    float x = 10.37;
    printf("%.0f\n", x);
    float s = x - int(x);
    printf("%.0f", s * 100);
}
