#include <iostream>
using namespace std;
int main()
{
    printf(""); // мінімальний printf який нічого не виводить(пустий рядок)
    int x = 10;
    //cout << '(' << x << ')' << '\n';

    printf("(%d)\n", x); // у форматований рядок на місце спец. послідовності 
    // %d - підставляється значення що написано в дужках функції,
    // щоб вивести змінну "x" в дужках ми пишемо "(%d)"

    int a = 5, b = 6, c = 7;
    printf("%d,%d,%d\n", a, b, c); // значення в дужках після рядка підставляються
    // у суровому порядку (як записані в тій послідовності і підставляються)
    // cout << a << ',' << b << ',' << c << '\n;
    
    printf("%d    |    %d\n", 10, 11);
    // cout << 10 << "     |     " << 11 << '\n';
}
